HW2/VAO.org
#+Title: Computer Graphics Homework 2: OpenGL Vertex array object
#+Author: Ali Mehmandoost (963624020)
#+Date: November 17, 2017
#+OPTIONS: ^:nil
 #+OPTIONS: toc:2
\newpage
* What is Vertex array object
https://www.khronos.org/opengl/wiki/Vertex_Specification#Vertex_Array_Object

A Vertex Array Object (VAO) is an OpenGL Object that stores all of the state needed to supply vertex data. It stores the format of the vertex data as well as the Buffer Objects providing the vertex data arrays. Note that VAOs do not copy, freeze or store the contents of the referenced buffers if you change any of the data in the buffers referenced by an existing VAO, those changes will be seen by users of the VAO.


* Whats the difference between Vertex array Object and Vertex Buffer object
http://www.songho.ca/opengl/gl_vbo.html

Vertex array functions are in the client state [RAM] and the data in the arrays must be re-sent to the server each time when it is referenced.
But Vertex buffer object (VBO) creates "buffer objects" for vertex attributes in high-performance memory on the server side and provides same access functions to reference the arrays, which are used in vertex arrays, such as glVertexPointer(), glNormalPointer(), glTexCoordPointer(), etc. 

* Creating A Vertex array object

To create a Vertex array object first we need to enable the vertex array we want to use with glEnableClientState.

** glEnableClientState
glEnableClientState and glDisableClientState enable or disable individual client-side capabilities. By default, all client-side capabilities are disabled. Both glEnableClientState and glDisableClientState take a single argument, cap, which can assume one of the following values:

*** GL_COLOR_ARRAY
If enabled, the color array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
*** GL_EDGE_FLAG _ARRAY
If enabled, the edge flag array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
*** GL_FOG_COORD _ARRAY
If enabled, the fog coordinate array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or  glMultiDrawElements is called.
*** GL_INDEX_ARRAY
If enabled, the index array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
*** GL_NORMAL_ARRAY
If enabled, the normal array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
*** GL _SECONDARY_COLOR_ARRAY 
If enabled, the secondary color array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called. 
*** GL_TEXTURE_COORD_ARRAY
If enabled, the texture coordinate array is enabled for writing and used  during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
*** GL_VERTEX_ARRAY
If enabled, the vertex array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.

                    

* Specifies the location and data format 

After Creating VAO we need to specifies the location and data format of Array with one of the following functions:

** glVertexPointer

https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glVertexPointer.xml


void glVertexPointer(GLint size,  GLenum type,  GLsizei stride,  const GLvoid * pointer);
*** Parameters
**** size
Specifies the number of coordinates per vertex. Must be 2, 3, or 4. The initial value is 4.
**** type
Specifies the data type of each coordinate in the array. Symbolic constants GL_SHORT, GL_INT, GL_FLOAT, or GL_DOUBLE are accepted. The initial value is GL_FLOAT.
**** stride
Specifies the byte offset between consecutive vertices. If stride is 0, the vertices are understood to be tightly packed in the array. The initial value is 0.
**** pointer
Specifies a pointer to the first coordinate of the first vertex in the array. The initial value is 0.
*** Description
glVertexPointer specifies the location and data format of an array of vertex coordinates to use when rendering. size specifies the number of coordinates per vertex, and must be 2, 3, or 4. type specifies the data type of each coordinate, and stride specifies the byte stride from one vertex to the next, allowing vertices and attributes to be packed into a single array or stored in separate arrays.
If a non-zero named buffer object is bound to the GL_ARRAY_BUFFER target  while a vertex array is specified, pointer is treated as a byte offset into the buffer object's data store. Also, the buffer object binding (GL_ARRAY_BUFFER_BINDING) is saved as vertex array client-side state (GL_VERTEX_ARRAY_BUFFER_BINDING). When a vertex array is specified, size, type, stride, and pointer are saved as client-side state, in addition to the current vertex array buffer object binding.
        
