HW2/VAO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Computer Graphics Homework 2: OpenGL Vertex array object</title>
<!-- 2017-11-17 Fri 18:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ali Mehmandoost (963624020)" />
</head>
<body>
<div id="content">
<h1 class="title">Computer Graphics Homework 2: OpenGL Vertex array object</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What is Vertex array object</a></li>
<li><a href="#sec-2">2. Whats the difference between Vertex array Object and Vertex Buffer object</a></li>
<li><a href="#sec-3">3. Creating A Vertex array object</a>
<ul>
<li><a href="#sec-3-1">3.1. glEnableClientState</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Specifies the location and data format</a>
<ul>
<li><a href="#sec-4-1">4.1. glVertexPointer</a></li>
<li><a href="#sec-4-2">4.2. glColorPointer</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Render primitives from VAO:</a>
<ul>
<li><a href="#sec-5-1">5.1. glDrawArrays</a></li>
<li><a href="#sec-5-2">5.2. glDrawElements</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Example</a></li>
</ul>
</div>
</div>
<p>
\newpage
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is Vertex array object</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.khronos.org/opengl/wiki/Vertex_Specification#Vertex_Array_Object">https://www.khronos.org/opengl/wiki/Vertex_Specification#Vertex_Array_Object</a>
</p>

<p>
A Vertex Array Object (VAO) is an OpenGL Object that stores all of the state needed to supply vertex data. It stores the format of the vertex data as well as the Buffer Objects providing the vertex data arrays. Note that VAOs do not copy, freeze or store the contents of the referenced buffers if you change any of the data in the buffers referenced by an existing VAO, those changes will be seen by users of the VAO.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Whats the difference between Vertex array Object and Vertex Buffer object</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://www.songho.ca/opengl/gl_vbo.html">http://www.songho.ca/opengl/gl_vbo.html</a>
</p>

<p>
Vertex array functions are in the client state [RAM] and the data in the arrays must be re-sent to the server each time when it is referenced.
But Vertex buffer object (VBO) creates "buffer objects" for vertex attributes in high-performance memory on the server side and provides same access functions to reference the arrays, which are used in vertex arrays, such as glVertexPointer(), glNormalPointer(), glTexCoordPointer(), etc. 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Creating A Vertex array object</h2>
<div class="outline-text-2" id="text-3">
<p>
To create a Vertex array object first we need to enable the vertex array we want to use with glEnableClientState.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> glEnableClientState</h3>
<div class="outline-text-3" id="text-3-1">
<p>
glEnableClientState and glDisableClientState enable or disable individual client-side capabilities. By default, all client-side capabilities are disabled. Both glEnableClientState and glDisableClientState take a single argument, cap, which can assume one of the following values:
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> GL_COLOR_ARRAY</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
If enabled, the color array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> GL_EDGE_FLAG _ARRAY</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
If enabled, the edge flag array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> GL_FOG_COORD _ARRAY</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
If enabled, the fog coordinate array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or  glMultiDrawElements is called.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> GL_INDEX_ARRAY</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
If enabled, the index array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> GL_NORMAL_ARRAY</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
If enabled, the normal array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> GL _SECONDARY_COLOR_ARRAY</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
If enabled, the secondary color array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called. 
</p>
</div>
</div>
<div id="outline-container-sec-3-1-7" class="outline-4">
<h4 id="sec-3-1-7"><span class="section-number-4">3.1.7</span> GL_TEXTURE_COORD_ARRAY</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
If enabled, the texture coordinate array is enabled for writing and used  during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-8" class="outline-4">
<h4 id="sec-3-1-8"><span class="section-number-4">3.1.8</span> GL_VERTEX_ARRAY</h4>
<div class="outline-text-4" id="text-3-1-8">
<p>
If enabled, the vertex array is enabled for writing and used during rendering when glArrayElement, glDrawArrays, glDrawElements, glDrawRangeElements glMultiDrawArrays, or glMultiDrawElements is called.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Specifies the location and data format</h2>
<div class="outline-text-2" id="text-4">
<p>
After Creating VAO we need to specifies the location and data format of Array with one of the following functions:
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> glVertexPointer</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glVertexPointer.xml">https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glVertexPointer.xml</a>
</p>


<p>
void glVertexPointer(GLint size,  GLenum type,  GLsizei stride,  const GLvoid * pointer);
</p>
</div>
