HW2/VAO.html
<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Parameters</h4>
<div class="outline-text-4" id="text-4-1-1">
</div><ol class="org-ol"><li><a id="sec-4-1-1-1" name="sec-4-1-1-1"></a>size<br  /><div class="outline-text-5" id="text-4-1-1-1">
<p>
Specifies the number of coordinates per vertex. Must be 2, 3, or 4. The initial value is 4.
</p>
</div>
</li>
<li><a id="sec-4-1-1-2" name="sec-4-1-1-2"></a>type<br  /><div class="outline-text-5" id="text-4-1-1-2">
<p>
Specifies the data type of each coordinate in the array. Symbolic constants GL_SHORT, GL_INT, GL_FLOAT, or GL_DOUBLE are accepted. The initial value is GL_FLOAT.
</p>
</div>
</li>
<li><a id="sec-4-1-1-3" name="sec-4-1-1-3"></a>stride<br  /><div class="outline-text-5" id="text-4-1-1-3">
<p>
Specifies the byte offset between consecutive vertices. If stride is 0, the vertices are understood to be tightly packed in the array. The initial value is 0.
</p>
</div>
</li>
<li><a id="sec-4-1-1-4" name="sec-4-1-1-4"></a>pointer<br  /><div class="outline-text-5" id="text-4-1-1-4">
<p>
Specifies a pointer to the first coordinate of the first vertex in the array. The initial value is 0.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Description</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
glVertexPointer specifies the location and data format of an array of vertex coordinates to use when rendering. size specifies the number of coordinates per vertex, and must be 2, 3, or 4. type specifies the data type of each coordinate, and stride specifies the byte stride from one vertex to the next, allowing vertices and attributes to be packed into a single array or stored in separate arrays.
If a non-zero named buffer object is bound to the GL_ARRAY_BUFFER target  while a vertex array is specified, pointer is treated as a byte offset into the buffer object's data store. Also, the buffer object binding (GL_ARRAY_BUFFER_BINDING) is saved as vertex array client-side state (GL_VERTEX_ARRAY_BUFFER_BINDING). When a vertex array is specified, size, type, stride, and pointer are saved as client-side state, in addition to the current vertex array buffer object binding.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> glColorPointer</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glColorPointer.xml">https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glColorPointer.xml</a>
</p>


<p>
void glColorPointer(GLint size,  GLenum type,  GLsizei stride,  const GLvoid * pointer);
</p>
</div>
<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Parameters</h4>
<div class="outline-text-4" id="text-4-2-1">
</div><ol class="org-ol"><li><a id="sec-4-2-1-1" name="sec-4-2-1-1"></a>size<br  /><div class="outline-text-5" id="text-4-2-1-1">
<p>
Specifies the number of components per color. Must be 3 or 4. The initial value is 4.
</p>
</div>
</li>
<li><a id="sec-4-2-1-2" name="sec-4-2-1-2"></a>type<br  /><div class="outline-text-5" id="text-4-2-1-2">
<p>
Specifies the data type of each color component in the array. Symbolic constants GL_BYTE, GL_UNSIGNED_BYTE, GL_SHORT, GL_UNSIGNED_SHORT, GL_INT, GL_UNSIGNED_INT, GL_FLOAT, and GL_DOUBLE are accepted. The initial value is GL_FLOAT.
</p>
</div>
</li>
<li><a id="sec-4-2-1-3" name="sec-4-2-1-3"></a>stride<br  /><div class="outline-text-5" id="text-4-2-1-3">
<p>
Specifies the byte offset between consecutive colors. If stride is 0, the colors are understood to be tightly packed in the array. The initial value is 0. 
</p>
</div>
</li>
<li><a id="sec-4-2-1-4" name="sec-4-2-1-4"></a>pointer<br  /><div class="outline-text-5" id="text-4-2-1-4">
<p>
Specifies a pointer to the first component of the first color element in the array. The initial value is 0.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Description</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
glColorPointer specifies the location and data format of an array of color components to use when rendering. size specifies the number of components per color, and must be 3 or 4. type specifies the data type of each color component, and stride specifies the byte stride from one color to the next, allowing vertices and attributes to be packed into a single array or stored in separate arrays. If a non-zero named buffer object is bound to the GL_ARRAY_BUFFER target while a color array is specified, pointer is treated as a byte offset into the buffer object's data store. Also, the buffer object binding is saved as color vertex array client-side state. When a color array is specified,size, type, stride, and pointer are saved as client-side state, in addition to the current vertex array buffer object binding.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Render primitives from VAO:</h2>
<div class="outline-text-2" id="text-5">
<p>
After creating vertex attributes in VAO we can render them with one of the following functions:
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> glDrawArrays</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glDrawArrays.xml">https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glDrawArrays.xml</a>
void glDrawArrays(GLenum mode,  GLint first,  GLsizei count); 
</p>
</div>
<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Parameters</h4>
<div class="outline-text-4" id="text-5-1-1">
</div><ol class="org-ol"><li><a id="sec-5-1-1-1" name="sec-5-1-1-1"></a>mode<br  /><div class="outline-text-5" id="text-5-1-1-1">
<p>
Specifies what kind of primitives to render. Symbolic constants GL_POINTS, GL_LINE_STRIP, GL_LINE_LOOP, GL_LINES, GL_TRIANGLE_STRIP, GL_TRIANGLE_FAN, GL_TRIANGLES, GL_QUAD_STRIP, GL_QUADS, and GL_POLYGON are accepted.
</p>
</div>
</li>
<li><a id="sec-5-1-1-2" name="sec-5-1-1-2"></a>first<br  /><div class="outline-text-5" id="text-5-1-1-2">
<p>
Specifies the starting index in the enabled arrays.
</p>
</div>
</li>
<li><a id="sec-5-1-1-3" name="sec-5-1-1-3"></a>count<br  /><div class="outline-text-5" id="text-5-1-1-3">
<p>
Specifies the number of indices to be rendered.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Description</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
glDrawArrays specifies multiple geometric primitives with very few subroutine calls. Instead of calling a GL procedure to pass each individual vertex, normal, texture coordinate, edge flag, or color, you can prespecify separate arrays of vertices, normals, and colors and use them to construct a sequence of primitives with a single call to glDrawArrays.
</p>

<p>
When glDrawArrays is called, it uses count sequential elements from each enabled array to construct a sequence of geometric primitives, beginning with element first. mode specifies what kind of primitives are constructed and how the array elements construct those primitives. If GL_VERTEX_ARRAY is not enabled, no geometric primitives are generated. 
</p>

<p>
Vertex attributes that are modified by glDrawArrays have an unspecified value after glDrawArrays returns. For example, if GL_COLOR_ARRAY is enabled, the value of the current color is undefined after glDrawArrays executes. Attributes that aren't modified remain well defined.         
</p>
</div>
</div>
</div>


<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> glDrawElements</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glDrawElements.xml">https://www.khronos.org/registry/OpenGL-Refpages/gl2.1/xhtml/glDrawElements.xml</a>
void glDrawElements(GLenum mode,  GLsizei count,  GLenum type,  const GLvoid * indices);
</p>
</div>
<div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Parameters</h4>
<div class="outline-text-4" id="text-5-2-1">
</div><ol class="org-ol"><li><a id="sec-5-2-1-1" name="sec-5-2-1-1"></a>mode<br  /><div class="outline-text-5" id="text-5-2-1-1">
<p>
Specifies what kind of primitives to render. Symbolic constants GL_POINTS, GL_LINE_STRIP, GL_LINE_LOOP, GL_LINES, GL_TRIANGLE_STRIP, GL_TRIANGLE_FAN, GL_TRIANGLES, GL_QUAD_STRIP, GL_QUADS, and GL_POLYGON are accepted.
</p>
</div>
</li>
<li><a id="sec-5-2-1-2" name="sec-5-2-1-2"></a>count<br  /><div class="outline-text-5" id="text-5-2-1-2">
<p>
Specifies the number of elements to be rendered.
</p>
</div>
</li>
<li><a id="sec-5-2-1-3" name="sec-5-2-1-3"></a>type<br  /><div class="outline-text-5" id="text-5-2-1-3">
<p>
Specifies the type of the values in indices. Must be one of GL_UNSIGNED_BYTE, GL_UNSIGNED_SHORT, or GL_UNSIGNED_INT.
</p>
</div>
</li>
<li><a id="sec-5-2-1-4" name="sec-5-2-1-4"></a>indices<br  /><div class="outline-text-5" id="text-5-2-1-4">
<p>
Specifies a pointer to the location where the indices are stored.
</p>
</div>
</li></ol>
</div>
