HW2/VAO.org
*** Description
glDrawElements specifies multiple geometric primitives with very few subroutine calls. Instead of calling a GL function to pass each individual vertex, normal, texture coordinate, edge flag, or color, you can prespecify separate arrays of vertices, normals, and so on, and use them to construct a sequence of primitives with a single call to glDrawElements.

When glDrawElements is called, it uses count sequential elements from an enabled array, starting at indices to construct a sequence of geometric primitives. mode specifies what kind of primitives are constructed and how the array elements construct these primitives. If more than one array is enabled, each is used. If GL_VERTEX_ARRAY is not enabled, no geometric primitives are constructed.

Vertex attributes that are modified by glDrawElements have an unspecified value after glDrawElements returns. For example, if GL_COLOR_ARRAY is enabled, the value of the current color is undefined after glDrawElements executes. Attributes that aren't modified maintain their previous values. 




* Example
Lets Draw a color triangle.

[[SRC][https://github.com/Mehmandoost/ui36cg/tree/master/HW2]]

#+begin_src cpp

#include <GL/glew.h>
#include <GL/glut.h>


void handler_display();

float vertices[] = {			 \
	-1.0, -1.0, 0.0, \
	1.0, -1.0, 0.0,  \
	0.0, 1.0, 0.0 };

float colors[] = {		    \
	1.0, 0.0, 0.0, 1.0, \
	0.0, 1.0, 0.0, 1.0, \
	0.0, 0.0, 1.0, 1.0 };
	
int main(int argc, char **argv) {

	glutInit(&argc, argv);
	glutInitDisplayMode(GLUT_RGB | GLUT_SINGLE);

	glutInitWindowSize(500, 500);
	glutInitWindowPosition(0, 0);

	glutCreateWindow("VAO Test");

	glutDisplayFunc(handler_display);
	glutMainLoop();
	
}


void handler_display() {

	glClear(GL_COLOR_BUFFER_BIT);

	glVertexPointer(3, GL_FLOAT, 0, vertices);
	glEnableClientState(GL_VERTEX_ARRAY);

	glColorPointer(4, GL_FLOAT, 0, colors);
	glEnableClientState(GL_COLOR_ARRAY);
	
	glDrawArrays(GL_TRIANGLES, 0, 3);
	
	
	glDisableClientState(GL_VERTEX_ARRAY);
	glDisableClientState(GL_COLOR_ARRAY);
}


#+end_src
