HW2/VAO.html
<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> Description</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
glDrawElements specifies multiple geometric primitives with very few subroutine calls. Instead of calling a GL function to pass each individual vertex, normal, texture coordinate, edge flag, or color, you can prespecify separate arrays of vertices, normals, and so on, and use them to construct a sequence of primitives with a single call to glDrawElements.
</p>

<p>
When glDrawElements is called, it uses count sequential elements from an enabled array, starting at indices to construct a sequence of geometric primitives. mode specifies what kind of primitives are constructed and how the array elements construct these primitives. If more than one array is enabled, each is used. If GL_VERTEX_ARRAY is not enabled, no geometric primitives are constructed.
</p>

<p>
Vertex attributes that are modified by glDrawElements have an unspecified value after glDrawElements returns. For example, if GL_COLOR_ARRAY is enabled, the value of the current color is undefined after glDrawElements executes. Attributes that aren't modified maintain their previous values. 
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Example</h2>
<div class="outline-text-2" id="text-6">
<p>
Lets Draw a color triangle.
</p>

<p>
<i><a href="https://github.com/Mehmandoost/ui36cg/tree/master/HW2">https://github.com/Mehmandoost/ui36cg/tree/master/HW2</a></i>
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;GL/glew.h&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;GL/glut.h&gt;</span>


<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">handler_display</span>();

<span style="color: #ce537a; font-weight: bold;">float</span> <span style="color: #7590db;">vertices</span>[] = {                     \
        -1.0, -1.0, 0.0, \
        1.0, -1.0, 0.0,  \
        0.0, 1.0, 0.0 };

<span style="color: #ce537a; font-weight: bold;">float</span> <span style="color: #7590db;">colors</span>[] = {                  \
        1.0, 0.0, 0.0, 1.0, \
        0.0, 1.0, 0.0, 1.0, \
        0.0, 0.0, 1.0, 1.0 };

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span> **<span style="color: #7590db;">argv</span>) {

        glutInit(&amp;argc, argv);
        glutInitDisplayMode(GLUT_RGB | GLUT_SINGLE);

        glutInitWindowSize(500, 500);
        glutInitWindowPosition(0, 0);

        glutCreateWindow(<span style="color: #2d9574;">"VAO Test"</span>);

        glutDisplayFunc(handler_display);
        glutMainLoop();

}


<span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">handler_display</span>() {

        glClear(GL_COLOR_BUFFER_BIT);

        glVertexPointer(3, GL_FLOAT, 0, vertices);
        glEnableClientState(GL_VERTEX_ARRAY);

        glColorPointer(4, GL_FLOAT, 0, colors);
        glEnableClientState(GL_COLOR_ARRAY);

        glDrawArrays(GL_TRIANGLES, 0, 3);


        glDisableClientState(GL_VERTEX_ARRAY);
        glDisableClientState(GL_COLOR_ARRAY);
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: November 17, 2017</p>
<p class="author">Author: Ali Mehmandoost (963624020)</p>
<p class="date">Created: 2017-11-17 Fri 18:33</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
